This means that secrets from a vault can be displayed both at creation and recovery.

At creation when using this configuration file:
```
resource "random_password" "sql" {
  length           = 16
  special          = true
  override_special = "!@#$%&*()-_=+[]:?"
  min_upper        = 1
  min_lower        = 1
  min_numeric      = 1
  min_special      = 1
}

output "random_password_sql" {
  value = random_password.sql.result
}

resource "azurerm_key_vault_secret" "sql_password" {
  name         = "sql-password"
  value        = random_password.sql.result
  key_vault_id = azurerm_key_vault.my_vault.id
}

output "azurerm_key_vault_secret_sql_password" {
  value = azurerm_key_vault_secret.sql_password.value
}
```

I obtain the output:
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_password.sql will be created
  + resource "random_password" "sql" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 1
      + min_numeric      = 1
      + min_special      = 1
      + min_upper        = 1
      + number           = true
      + override_special = "!@#$%&*()-_=+[]:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # azurerm_key_vault_secret.sql_password will be created
  + resource "azurerm_key_vault_secret" "sql_password" {
      + id           = (known after apply)
      + key_vault_id = "[removed content]"
      + name         = "sql-password"
      + value        = (sensitive value)
      + version      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + azurerm_key_vault_secret_sql_password = (known after apply)
  + random_password_sql = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

random_password.sql: Creating...
random_password.sql: Creation complete after 0s [id=none]

azurerm_key_vault_secret.sql_password: Creating...
azurerm_key_vault_secret.sql_password: Creation complete after 4s [id=[removed content]]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

azurerm_key_vault_secret_sql_password = "o!%!RVodF024yt_v"
random_password_sql = "o!%!RVodF024yt_v"
```

At recovery when using this configuration file:
```
data "azurerm_key_vault_secret" "sql_password" {
  name = "sql-password"
  key_vault_id = azurerm_key_vault.my_vault.id
}

output "data_azurerm_key_vault_secret_sql_password" {
  value = data.azurerm_key_vault_secret.sql_password.value
}
```

I obtain the output:
```
Outputs:

data_azurerm_key_vault_secret_sql_password = "o!%!RVodF024yt_v"
```